app/controllers/ristorantes_controller.rb

SELECT "ristorantes".* FROM "ristorantes"
---
    def index
        restaurants = Ristorante.all

SELECT "ristorantes".* FROM "ristorantes" WHERE "ristorantes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def show
        restaurant = Ristorante.find_by(id: params[:id])

INSERT INTO "ristorantes" ("name", "email", "location_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Chicken"], ["email", "chicken@gmail.com"], ["location_id", 2], ["created_at", "2023-03-29 06:46:08.926433"], ["updated_at", "2023-03-29 06:46:08.926433"]]
---
    def create
        restaurant = Ristorante.create(restaurant_params)