app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
    def index
        #get users
        render json: User.all, status: :ok

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
---
     def show

        user = User.find_by(id: session[:user_id])

UPDATE "users" SET "username" = ?, "password_digest" = ?, "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "Testing"], ["password_digest", "[FILTERED]"], ["email", "testing@gmail.com"], ["updated_at", "2023-03-29 06:23:09.895478"], ["id", 2]]
---
    def update
        user = find_user
        if user.valid?
            user.update(user_params)

INSERT INTO "users" ("username", "password_digest", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "Test"], ["password_digest", "[FILTERED]"], ["email", "test@gmail.com"], ["created_at", "2023-03-29 06:18:59.017999"], ["updated_at", "2023-03-29 06:18:59.017999"]]
---
    def create
        user = User.create!(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]
---
   def destroy
    # check whether the task exists
    user = User.find_by(id:params[:id])

   #  delete the task
   if user
       user.destroy

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def find_user
        User.find(params[:id])